Console.Write("Введите число от 1 до 7: ");
string a = Console.ReadLine();
if (a=="1")
{
  Console.WriteLine("Понедельник");

}
else if (a=="2")
{
  Console.WriteLine("Вторник");

}
else if (a=="3")
{
  Console.WriteLine("Среда");

}
else if (a=="4")
{
  Console.WriteLine("Четверг");

}
else if (a=="5")
{
  Console.WriteLine("Пятница");

}
else if (a=="6")
{
  Console.WriteLine("Суббота");

}
else if (a=="7")
{
  Console.WriteLine("Воскресенье");

}
else 
{
    Console.WriteLine("Данные не корректны"); 



5. Напишите программу, которая на вход принимает
одно число (N), а на выходе показывает все целые
числа в промежутке от -N до N.
4 -> "-4, -3, -2, -1, 0, 1, 2, 3, 4"
2 -> " -2, -1, 0, 1, 2"
Итерация №2
Решение в группах задач: 20 мин
7. Напишите программу, которая принимает на вход
трёхзначное число и на выходе показывает последнюю цифру
этого числа.
456 -> 6
782 -> 2
918 -> 8
